#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Skryba/skryba-cli/runs/run-RR3wcCmxpgEFnwWR

Waiting for the plan to start...

Terraform v0.14.9
Configuring remote state backend...
Initializing Terraform configuration...
time_sleep.sigserv_60_seconds: Refreshing state... [id=2021-04-13T08:02:21Z]
aws_vpc.app_vpc: Refreshing state... [id=vpc-0d35418390a203e3b]
aws_cloudwatch_log_group.api_logs: Refreshing state... [id=api-logs]
aws_iam_role.ecs_role: Refreshing state... [id=ecs_app]
aws_s3_bucket.client_bucket: Refreshing state... [id=app.skryba.link]
aws_ecs_cluster.api_cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:086627185220:cluster/api_cluster]
aws_eip.eip_manager: Refreshing state... [id=eipalloc-02f492905e70dd457]
aws_iam_role_policy_attachment.ecs_policy_attachment: Refreshing state... [id=ecs_app-20210413075958753700000001]
aws_ecs_task_definition.api_task: Refreshing state... [id=api]
aws_subnet.public_a: Refreshing state... [id=subnet-009c43520bcc42255]
aws_security_group.api_sg: Refreshing state... [id=sg-019dc8724d9a1a250]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-009e5911444e7f72b]
aws_subnet.public_b: Refreshing state... [id=subnet-06f1235a8b6b8b12e]
aws_route.internet_access: Refreshing state... [id=r-rtb-0069d93e9bed27dec1080289494]
aws_ecs_service.api_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:086627185220:service/api_cluster/api_service]
aws_route53_record.app: Refreshing state... [id=Z00408931X4PHFVTCW5MH_api_A]
aws_s3_bucket_policy.client_bucket_policy: Refreshing state... [id=app.skryba.link]
aws_cloudfront_distribution.fronted_cloudfront: Refreshing state... [id=E31PF9FWOAXSVP]
aws_route53_record.frontend: Refreshing state... [id=Z00408931X4PHFVTCW5MH_app_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_network_interface.networkinterfacesigserv will be read during apply
  # (config refers to values not yet known)
 <= data "aws_network_interface" "networkinterfacesigserv"  {
      ~ association       = [
          - {
              - allocation_id     = ""
              - association_id    = ""
              - carrier_ip        = ""
              - customer_owned_ip = ""
              - ip_owner_id       = "amazon"
              - public_dns_name   = "ec2-54-217-40-96.eu-west-1.compute.amazonaws.com"
              - public_ip         = "54.217.40.96"
            },
        ] -> (known after apply)
      ~ attachment        = [
          - {
              - attachment_id     = "eni-attach-0e5d534436e796e58"
              - device_index      = 1
              - instance_id       = ""
              - instance_owner_id = ""
            },
        ] -> (known after apply)
      ~ availability_zone = "eu-west-1b" -> (known after apply)
      ~ description       = "arn:aws:ecs:eu-west-1:086627185220:attachment/9ad1567c-6d3b-4835-8c89-2d4c58eec9bd" -> (known after apply)
      ~ id                = "eni-03583c3d23bfd625a" -> (known after apply)
      ~ interface_type    = "interface" -> (known after apply)
      ~ ipv6_addresses    = [] -> (known after apply)
      ~ mac_address       = "0a:d9:99:02:9a:bd" -> (known after apply)
      + outpost_arn       = (known after apply)
      ~ owner_id          = "086627185220" -> (known after apply)
      ~ private_dns_name  = "ip-10-0-2-35.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip        = "10.0.2.35" -> (known after apply)
      ~ private_ips       = [
          - "10.0.2.35",
        ] -> (known after apply)
      ~ requester_id      = "578734482556" -> (known after apply)
      ~ security_groups   = [
          - "sg-019dc8724d9a1a250",
        ] -> (known after apply)
      ~ subnet_id         = "subnet-06f1235a8b6b8b12e" -> (known after apply)
      ~ tags              = {} -> (known after apply)
      ~ vpc_id            = "vpc-0d35418390a203e3b" -> (known after apply)
    }

  # data.aws_network_interfaces.all_network_interfaces will be read during apply
  # (config refers to values not yet known)
 <= data "aws_network_interfaces" "all_network_interfaces"  {
      ~ id   = "eu-west-1" -> (known after apply)
      ~ ids  = [
          - "eni-03583c3d23bfd625a",
        ] -> (known after apply)
      + tags = (known after apply)
    }

  # data.aws_network_interfaces.networkinterfacesigserv will be read during apply
  # (config refers to values not yet known)
 <= data "aws_network_interfaces" "networkinterfacesigserv"  {
      ~ id   = "eu-west-1" -> (known after apply)
      ~ ids  = [
          - "eni-03583c3d23bfd625a",
        ] -> (known after apply)
      + tags = (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.app will be updated in-place
  ~ resource "aws_route53_record" "app" {
        id      = "Z00408931X4PHFVTCW5MH_api_A"
        name    = "api"
      ~ records = [
          - "54.217.40.96",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # time_sleep.sigserv_60_seconds will be destroyed
  - resource "time_sleep" "sigserv_60_seconds" {
      - create_duration = "60s" -> null
      - id              = "2021-04-13T08:02:21Z" -> null
    }

  # time_sleep.sigserv_90_seconds will be created
  + resource "time_sleep" "sigserv_90_seconds" {
      + create_duration = "90s"
      + id              = (known after apply)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ all_network_interfaces  = jsonencode(
        {
          - filter = null
          - id     = "eu-west-1"
          - ids    = [
              - "eni-03583c3d23bfd625a",
            ]
          - tags   = null
        }
    ) -> (known after apply)
  ~ ecs_privateipv4_sigserv = "10.0.2.35" -> (known after apply)
  ~ ecs_publicipv4_sigserv  = "54.217.40.96" -> (known after apply)
  ~ ecs_serv_data           = {
      ~ association       = [
          - {
              - allocation_id     = ""
              - association_id    = ""
              - carrier_ip        = ""
              - customer_owned_ip = ""
              - ip_owner_id       = "amazon"
              - public_dns_name   = "ec2-54-217-40-96.eu-west-1.compute.amazonaws.com"
              - public_ip         = "54.217.40.96"
            },
        ] -> (known after apply)
      ~ attachment        = [
          - {
              - attachment_id     = "eni-attach-0e5d534436e796e58"
              - device_index      = 1
              - instance_id       = ""
              - instance_owner_id = ""
            },
        ] -> (known after apply)
      ~ availability_zone = "eu-west-1b" -> (known after apply)
      ~ description       = "arn:aws:ecs:eu-west-1:086627185220:attachment/9ad1567c-6d3b-4835-8c89-2d4c58eec9bd" -> (known after apply)
      ~ filter            = null -> []
      ~ id                = "eni-03583c3d23bfd625a" -> (known after apply)
      ~ interface_type    = "interface" -> (known after apply)
      ~ ipv6_addresses    = [] -> (known after apply)
      ~ mac_address       = "0a:d9:99:02:9a:bd" -> (known after apply)
      ~ outpost_arn       = "" -> (known after apply)
      ~ owner_id          = "086627185220" -> (known after apply)
      ~ private_dns_name  = "ip-10-0-2-35.eu-west-1.compute.internal" -> (known after apply)
      ~ private_ip        = "10.0.2.35" -> (known after apply)
      ~ private_ips       = [
          - "10.0.2.35",
        ] -> (known after apply)
      ~ requester_id      = "578734482556" -> (known after apply)
      ~ security_groups   = [
          - "sg-019dc8724d9a1a250",
        ] -> (known after apply)
      ~ subnet_id         = "subnet-06f1235a8b6b8b12e" -> (known after apply)
      ~ tags              = {} -> (known after apply)
      ~ vpc_id            = "vpc-0d35418390a203e3b" -> (known after apply)
    }
  ~ ecs_serv_interfaces     = {
      ~ id     = "eu-west-1" -> (known after apply)
      ~ ids    = [
          - "eni-03583c3d23bfd625a",
        ] -> (known after apply)
      ~ tags   = null -> (known after apply)
        # (1 unchanged element hidden)
    }
  ~ ecs_serv_interfaces_str = jsonencode(
        {
          - filter = [
              - {
                  - name   = "group-id"
                  - values = [
                      - "sg-019dc8724d9a1a250",
                    ]
                },
            ]
          - id     = "eu-west-1"
          - ids    = [
              - "eni-03583c3d23bfd625a",
            ]
          - tags   = null
        }
    ) -> (known after apply)

Warning: Value for undeclared variable

The root module does not declare a variable named "access_key" but a value was
found in file "/terraform/terraform.tfvars". To use this value, add a
"variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "secret_key" but a value was
found in file "/terraform/terraform.tfvars". To use this value, add a
"variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```
</details>
*Pusher: @TheUnderScorer, Action: `pull_request`*